import React from "react";
import { useParams } from "react-router-dom";

const products = [
  { id: 1, name: " مبل طوسی",price: " 10,000,000 تومان", description: " طوسی با طراحی مدرن و رنگ خنثی، مناسب هر نوع دکوراسیون داخلی است. فریم چوبی مقاوم، پارچه باکیفیت و نشیمن راحت این  را به گزینه‌ای عالی برای نشیمن یا اتاق مهمان تبدیل کرده است" },
  { id: 2, name: " مبل نارنجی ", price: "12,000,000 تومان", description: "مبل نارنجی با رنگی گرم و پرانرژی، فضای خانه را زنده و دلپذیر می‌کند. این مبل مناسب افرادی است که به دنبال دکوراسیونی خاص و متفاوت هستند. طراحی ارگونومیک و فوم باکیفیت، راحتی فوق‌العاده‌ای را فراهم می‌کند" },
  { id: 3, name: " مبل کرم ", price: "16,000,000 تومان", description: "مبل کرم با ظاهری کلاسیک و شیک، حس آرامش و سادگی را به فضای خانه می‌آورد. ترکیب رنگ ملایم با پارچه لطیف، آن را به انتخابی ایده‌آل برای دکوراسیون‌های مینیمال و روشن تبدیل کرده است"},
  { id: 4, name: " مبل چرمی ", price: "40,000,000 تومان", description: "مبل چرمی با طراحی لوکس و استفاده از چرم باکیفیت، گزینه‌ای مناسب برای فضاهای رسمی یا دکوراسیون‌های مدرن است. دوام بالا، نظافت آسان و ظاهر خاص این مبل، آن را به انتخابی لاکچری تبدیل کرده است"},
  { id: 5, name: " مبل سبز", price: "15,000,000 تومان", description: "مبل سبز با رنگی آرام‌بخش و طبیعی، حس طراوت را به فضای خانه می‌بخشد. طراحی استاندارد و ساختار مقاوم، این مبل را برای استفاده روزمره و طولانی‌مدت بسیار مناسب کرده است" },
  { id: 6, name: " مبل آبی", price: "16,000,000 تومان", description: "مبل آبی با رنگی خنک و آرامش‌بخش، انتخابی مناسب برای فضاهای نشیمن مدرن است. طراحی ظریف، پایه‌های مقاوم و پارچه باکیفیت، راحتی و زیبایی را در کنار هم فراهم کرده‌اند" },
];

const ProductPage = () => {
  const { id } = useParams();
  const productId = parseInt(id, 10); // چون useParams رشته می‌ده

  const product = products.find(p => p.id === productId);

  if (!product) return <p>محصول پیدا نشد!</p>;

  return (
    <div className="product-page">
      <h1>{product.name}</h1>
      <div className="image-placeholder2">
           
            <img src={product.Image} alt={product.name} className="product-image" />

           </div>
      <p>{product.description}</p>
      <p>قیمت: {product.price}</p>
      <button>افزودن به سبد خرید</button>
    </div>
  );
};

export default ProductPage;
